; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image2 - mode
	spectrograph0 - mode
	image3 - mode
	infrared1 - mode
	Star0 - direction
	Star3 - direction
	Star7 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star14 - direction
	GroundStation15 - direction
	GroundStation16 - direction
	Star17 - direction
	Star18 - direction
	GroundStation19 - direction
	Star6 - direction
	Star5 - direction
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	Star13 - direction
	Star20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Star23 - direction
	Star24 - direction
	Planet25 - direction
	Phenomenon26 - direction
	Phenomenon27 - direction
	Star28 - direction
	Phenomenon29 - direction
	Star30 - direction
	Planet31 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star6)
	(supports instrument1 image3)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star20)
	(supports instrument2 infrared1)
	(supports instrument2 image3)
	(supports instrument2 image2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star13)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite0 Phenomenon29)
	(have_image Star20 image2)
	(have_image Phenomenon21 infrared1)
	(have_image Planet22 infrared1)
	(have_image Star23 spectrograph0)
	(have_image Star24 infrared1)
	(have_image Planet25 image3)
	(have_image Phenomenon26 image3)
	(have_image Phenomenon27 image3)
	(have_image Star28 infrared1)
	(have_image Phenomenon29 image2)
	(have_image Star30 image3)
	(have_image Planet31 image3)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 13
2. (turn_to satellite1 phenomenon21 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon21)
   goals met: 0 of 13
3. (turn_to satellite0 phenomenon29 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 phenomenon29)
   goals met: 1 of 13
4. (turn_to satellite1 star13 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 star13)
   goals met: 1 of 13
5. (calibrate satellite1 instrument2 star13)
   added: (calibrated instrument2)
   goals met: 1 of 13
6. (turn_to satellite1 phenomenon21 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 phenomenon21)
   goals met: 1 of 13
7. (take_image satellite1 phenomenon21 instrument2 infrared1)
   added: (have_image phenomenon21 infrared1)
   goals met: 2 of 13
8. (turn_to satellite1 phenomenon26 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 phenomenon26)
   goals met: 2 of 13
9. (take_image satellite1 phenomenon26 instrument2 image3)
   added: (have_image phenomenon26 image3)
   goals met: 3 of 13
10. (turn_to satellite1 phenomenon27 phenomenon26)
   deleted: (pointing satellite1 phenomenon26)
   added: (pointing satellite1 phenomenon27)
   goals met: 3 of 13
11. (take_image satellite1 phenomenon27 instrument2 image3)
   added: (have_image phenomenon27 image3)
   goals met: 4 of 13
12. (turn_to satellite1 phenomenon29 phenomenon27)
   deleted: (pointing satellite1 phenomenon27)
   added: (pointing satellite1 phenomenon29)
   goals met: 4 of 13
13. (take_image satellite1 phenomenon29 instrument2 image2)
   added: (have_image phenomenon29 image2)
   goals met: 5 of 13
14. (turn_to satellite1 planet22 phenomenon29)
   deleted: (pointing satellite1 phenomenon29)
   added: (pointing satellite1 planet22)
   goals met: 5 of 13
15. (take_image satellite1 planet22 instrument2 infrared1)
   added: (have_image planet22 infrared1)
   goals met: 6 of 13
16. (turn_to satellite1 planet25 planet22)
   deleted: (pointing satellite1 planet22)
   added: (pointing satellite1 planet25)
   goals met: 6 of 13
17. (take_image satellite1 planet25 instrument2 image3)
   added: (have_image planet25 image3)
   goals met: 7 of 13
18. (turn_to satellite1 planet31 planet25)
   deleted: (pointing satellite1 planet25)
   added: (pointing satellite1 planet31)
   goals met: 7 of 13
19. (take_image satellite1 planet31 instrument2 image3)
   added: (have_image planet31 image3)
   goals met: 8 of 13
20. (turn_to satellite1 star20 planet31)
   deleted: (pointing satellite1 planet31)
   added: (pointing satellite1 star20)
   goals met: 8 of 13
21. (take_image satellite1 star20 instrument2 image2)
   added: (have_image star20 image2)
   goals met: 9 of 13
22. (turn_to satellite1 star23 star20)
   deleted: (pointing satellite1 star20)
   added: (pointing satellite1 star23)
   goals met: 9 of 13
23. (take_image satellite1 star23 instrument2 spectrograph0)
   added: (have_image star23 spectrograph0)
   goals met: 10 of 13
24. (turn_to satellite1 star24 star23)
   deleted: (pointing satellite1 star23)
   added: (pointing satellite1 star24)
   goals met: 10 of 13
25. (take_image satellite1 star24 instrument2 infrared1)
   added: (have_image star24 infrared1)
   goals met: 11 of 13
26. (turn_to satellite1 star28 star24)
   deleted: (pointing satellite1 star24)
   added: (pointing satellite1 star28)
   goals met: 11 of 13
27. (take_image satellite1 star28 instrument2 infrared1)
   added: (have_image star28 infrared1)
   goals met: 12 of 13
28. (turn_to satellite1 star30 star28)
   deleted: (pointing satellite1 star28)
   added: (pointing satellite1 star30)
   goals met: 12 of 13
29. (take_image satellite1 star30 instrument2 image3)
   added: (have_image star30 image3)
   goals met: 13 of 13
